XML/Public/CPSQ01/request_pre/2022年3月1日/body_CPSQ01_request_pre_20220301203638.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:out="http://outsystem.ats.com.cn">
   <soapenv:Header/>
   <soapenv:Body>
      <out:outSystemWS>
         <out:in0>
         <![CDATA[
    <MBS>
        <pub>
        <SRCOUTSYSTEMCODE>OA</SRCOUTSYSTEMCODE>
        <SRCBATCHNO>txbtest2021</SRCBATCHNO>
        <TRANSCODE>CPSQ01</TRANSCODE>
        <TRANSDATETIME>2020-12-16 10:20:10</TRANSDATETIME>
        <MD5>123456</MD5>
        </pub>
    <req>
        <list>
            <detail>
            <URID>txbCPSQ01001_20220301203638</URID>
            <ORGCODE>001000</ORGCODE>
            <CODE>testCPSQ01001_20220301203638</CODE>
            <NAME>接口自动化测试交易对手导入01</NAME>
            <CATEGORYCODE>GYS</CATEGORYCODE>
            <ISACTIVE>1</ISACTIVE>
            </detail>
            <detail>
            <URID>txbCPSQ01002_20220301203638</URID>
            <ORGCODE>001000</ORGCODE>
            <CODE>testCPSQ01002_20220301203638</CODE>
            <NAME>接口自动化测试交易对手导入02</NAME>
            <CATEGORYCODE>YG</CATEGORYCODE>
            <ISACTIVE>1</ISACTIVE>
            </detail>
            <detail>
            <URID>txbCPSQ01003_20220301203638</URID>
            <ORGCODE>001000</ORGCODE>
            <CODE>testCPSQ01003_20220301203638</CODE>
            <NAME>接口自动化测试交易对手导入03</NAME>
            <CATEGORYCODE>hzf</CATEGORYCODE>
            <ISACTIVE>1</ISACTIVE>
            </detail>
            <detail>
            <URID>txbCPSQ01004_20220301203638</URID>
            <ORGCODE>001000</ORGCODE>
            <CODE>testCPSQ01004_20220301203638</CODE>
            <NAME>接口自动化测试交易对手导入04</NAME>
            <CATEGORYCODE>KH</CATEGORYCODE>
            <ISACTIVE>1</ISACTIVE>
            </detail>
        </list>
    </req>
    </MBS>
    ]]>
         </out:in0>
      </out:outSystemWS>
   </soapenv:Body>
</soapenv:Envelope>